---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.CannotDrawExtrusionsError
source: html/e522b65a-3441-b0bd-ed16-6661984ef0ed.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.CannotDrawExtrusionsError Property

Can't make Extrusion.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawExtrusionsError { get; }
```